{
  "_name_or_path": "model/best_model",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ar",
    "1": "cs",
    "2": "da",
    "3": "de",
    "4": "el",
    "5": "en",
    "6": "es",
    "7": "fi",
    "8": "fr",
    "9": "he",
    "10": "hi",
    "11": "hu",
    "12": "id",
    "13": "it",
    "14": "ja",
    "15": "ko",
    "16": "mn",
    "17": "ms",
    "18": "nl",
    "19": "pl",
    "20": "pt",
    "21": "ru",
    "22": "sv",
    "23": "sw",
    "24": "th",
    "25": "tl",
    "26": "tr",
    "27": "uk",
    "28": "vi",
    "29": "zh_cn",
    "30": "zh_tw"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ar": 0,
    "cs": 1,
    "da": 2,
    "de": 3,
    "el": 4,
    "en": 5,
    "es": 6,
    "fi": 7,
    "fr": 8,
    "he": 9,
    "hi": 10,
    "hu": 11,
    "id": 12,
    "it": 13,
    "ja": 14,
    "ko": 15,
    "mn": 16,
    "ms": 17,
    "nl": 18,
    "pl": 19,
    "pt": 20,
    "ru": 21,
    "sv": 22,
    "sw": 23,
    "th": 24,
    "tl": 25,
    "tr": 26,
    "uk": 27,
    "vi": 28,
    "zh_cn": 29,
    "zh_tw": 30
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.26.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
